{
  "navbar": {
    "title": "Gabriel Casanova",

    "links": [
      {"text": "home",       "url": "/"},
      {"text": "education",  "url": "/edu"},
      {"text": "experience", "url": "/exp"},
      {"text": "about",      "url": "/about"}
    ]
  },

  "pages": {
    "home": {
      "title": "Web development Portfolio"
    },

    "project": {
      "title": "Project",
      "return": "Return",
      "stack": "Tech stack",
      "links": "Links",
      "git": "GitHub",
      "site": "Website",
      "docs": "Documentation",
      "vid": "Demo Video"
    },

    "about": {
      "title": "About",
      "titleBig": "About Me",
      "text": "Hey there! I’m someone who enjoys building things that make life a little smoother — whether that’s creating smart, user-friendly web experiences or finding better ways to organize information behind the scenes. I like blending creativity with practicality, and I'm always up for solving problems in ways that feel intuitive and efficient. I enjoy making things that feel simple, thoughtful, and useful — for both the people using them and the people building them."
    },

    "notfound": {
      "text": "Page not found.",
      "return": "Return home?"
    }
  },

  "projects": {
    "pvic": {
      "name": "PVic Games Website",
      "type": "Freelance project",
      "year": "2025",
      "text": "I developed the PVic Games website as a freelance project for the indie game studio PVic Games. The design, inspired by the works of Brazilian artist Ziraldo, was created by me with guidance from the client to match their vision. The website is a responsive, static single-page application built with Vite, React, TypeScript, and Tailwind. It features smooth navigation using React Router and supports both the Portuguese and English languages with i18n integration. Modern animations, implemented with Animate.css and AOS, enhance the user experience. The ''about'' page includes an interactive 3D model powered by the Three.js WebGL library, adding a dynamic and engaging element to the site.",
      "stack": "vite,ts,react,tailwind",
      "links": {
        "site": "https://pvicvg.com/",
        "git": "https://github.com/pvicgames/pvicgames.github.io"
      },
      "pics": [
        "/img/pvic/1.png",
        "/img/pvic/2.png",
        "/img/pvic/3.png",
        "/img/pvic/4.png",
        "/img/pvic/5.png",
        "/img/pvic/6.png",
        "/img/pvic/7.png",
        "/img/pvic/8.png"
      ]
    },
    "edusyst": {
      "name": "EduSyst",
      "type": "Academic project",
      "year": "2024",
      "text": "EduSyst is a student information system (SIS) designed to modernize and streamline school administration in the public schools of Rio de Janeiro, Brazil. Developed as my final academic project at ISERJ, it was the culmination of my studies in Information Technology and earned me my associate degree. <br/> The system connects students, parents, teachers, and administrators through a unified digital platform, enhancing communication and organization. EduSyst consists of three interconnected applications, each tailored to different user needs and powered by a centralized MySQL database. <br/><br/> - The <strong> EduSyst Desktop App</strong>, built with Java SE, Swing, and the JDBC API, is designed for school administrators. It handles student and teacher registrations, course management, scheduling, and report generation, ensuring smooth institutional operations. <br/> - The <strong>EduSyst Web App</strong>, developed using Java Server Pages (JSP), HTML, CSS, Bootstrap, and JavaScript, serves students, teachers, and parents. Teachers can manage grades, transcripts, and student assessments while also communicating with students through a class chat system. Parents and students can access class schedules, assignments, and teacher information. <br/> - The <strong>EduSyst Mobile App</strong>, built with Android Studio (Java) and PHP for MySQL connectivity, offers a native mobile experience. It provides students, teachers, and parents with the same essential functionalities as the web app, ensuring accessibility on the go. <br/><br/> EduSyst was a challenge that pushed me to apply everything I had learned, from databases to fullstack development. Seeing it come together reinforced my passion for building software that solves real problems.",
      "stack": "html,css,bootstrap,js,java,mysql,androidstudio,php",
      "links": {
        "git": "https://github.com/gabcasanova/EduSyst",
        "docs": "https://drive.google.com/file/d/12UIDfrynj5Vg_2uMZ0yGxDLYsnEQFWQT"
      },
      "pics": [
        "/img/edusyst/1.png",
        "/img/edusyst/2.png",
        "/img/edusyst/3.png",
        "/img/edusyst/4.png",
        "/img/edusyst/5.png",
        "/img/edusyst/6.png",
        "/img/edusyst/7.png",
        "/img/edusyst/8.png"
      ]
    }
  },

  "footer": {
    "text": "All rights reserved. Rio de Janeiro, Brazil.",
    "lang": "Language: ",
    "en": "English",
    "pt": "Portuguese"
  }
}