{
  "navbar": {
    "title": "Gabriel Casanova",

    "links": [
      {"text": "home",       "url": "/"},
      {"text": "experience", "url": "/exp" },
      {"text": "about",      "url": "/about"}
    ]
  },

  "pages": {
    "home": {
      "web": "Web development Portfolio",
      "games": "Game Development Portfolio"
    },

    "project": {
      "title": "Project",
      "return": "Return",
      "stack": "Tech stack",
      "links": "Links",
      "git": "GitHub",
      "site": "Website",
      "docs": "Documentation",
      "vid": "Video",
      "play": "Play"
    },

    "experience": {
      "title": "Experience",
      "education": "Education",
      "career": "Career"
    },

    "about": {
      "title": "About",
      "titleBig": "About Me",
      "text": "👋 Hi! My name is Gabriel Casanova. <br/><br/> I am a multidisciplinary professional working in game design, game production, game development, and web development. <br/><br/> I enjoy working at the intersection of creativity and technology. I am always looking to learn, collaborate, and contribute to meaningful projects!"
    },

    "notfound": {
      "text": "Page not found.",
      "return": "Return home?"
    }
  },

  "projects": {
    "sonicmegamix": {
      "name": "Sonic Megamix Mania Website",
      "type": "Freelance Project",
      "year": "2026",
      "text": "Sonic Megamix Mania Project Website. The site is a Single-Page Application (SPA) developed with Vite, React, TypeScript, and Tailwind. The project explores web interactivity to recreate the atmosphere of classic 16-bit games through parallax effects and custom animations. The technical highlight lies in the main page's animation, which utilizes seven synchronized image layers to simulate a dynamic sea effect, emulating the visuals of classic Sonic games.",
      "stack": "vite,ts,react,tailwind",
      "links": {
        "site": "https://sonicmegamixmania.github.io/",
        "git":  "https://github.com/SonicMegamixMania/sonicmegamixmania.github.io"
      },
      "pics": [
        "/img/sonicmegamix/1.png",
        "/img/sonicmegamix/2.png",
        "/img/sonicmegamix/3.png",
        "/img/sonicmegamix/4.png",
        "/img/sonicmegamix/5.png",
        "/img/sonicmegamix/6.png",
        "/img/sonicmegamix/7.png"
      ]
    },
    "lucia": {
      "name": "Lucia Ippolito's Portfolio Site",
      "type": "Freelance Project",
      "year": "2025",
      "text": "Portfolio website for Brazilian journalist Lucia Ippolito. The website is a responsive, static single-page application built with Vite, React, TypeScript, and Tailwind. The site is powered by structured JSON-based content, allowing the client to easily update and expand sections without modifying the code itself. It features smooth navigation using React Router and supports localization with i18n integration.",
      "stack": "vite,ts,react,tailwind",
      "links": {
        "site": "https://luciaippolito.github.io/",
        "git":  "https://github.com/luciaippolito/luciaippolito.github.io"
      },
      "pics": [
        "/img/lucia/1.png",
        "/img/lucia/2.png",
        "/img/lucia/3.png",
        "/img/lucia/4.png",
        "/img/lucia/5.png",
        "/img/lucia/6.png",
        "/img/lucia/7.png"
      ]
    },
    "portfolio": {
      "name": "gabrielcasanova.com.br",
      "type": "Personal project",
      "year": "2025",
      "text": "My personal portfolio website. The website is a responsive, static single-page application built with Vite, React, TypeScript, and Tailwind. It features smooth navigation using React Router and supports both the Portuguese and English languages with i18n integration.",
      "stack": "vite,ts,react,tailwind",
      "links": {
        "site": "https://gabrielcasanova.com.br/",
        "git": "https://github.com/gabcasanova/gabcasanova.github.io"
      },
      "pics": [
        "/img/portfolio/1.png",
        "/img/portfolio/2.png",
        "/img/portfolio/3.png",
        "/img/portfolio/4.png",
        "/img/portfolio/5.png",
        "/img/portfolio/6.png"
      ]
    },
    "pvic": {
      "name": "PVic Games Website",
      "type": "Freelance project",
      "year": "2025",
      "text": "I was contracted as a freelance developer to build the official website for the indie game studio PVic Games. The design, inspired by the works of Brazilian artist Ziraldo, was created by me with guidance from the client to match their vision. The website is a responsive, static single-page application built with Vite, React, TypeScript, and Tailwind. It features smooth navigation using React Router and supports both the Portuguese and English languages with i18n integration. Modern animations, implemented with Animate.css and AOS, enhance the user experience. The ''about'' page includes an interactive 3D model powered by the Three.js WebGL library, adding a dynamic and engaging element to the site.",
      "stack": "vite,ts,react,tailwind",
      "links": {
        "site": "https://pvicvg.com/",
        "git": "https://github.com/pvicgames/pvicgames.github.io"
      },
      "pics": [
        "/img/pvic/1.png",
        "/img/pvic/2.png",
        "/img/pvic/3.png",
        "/img/pvic/4.png",
        "/img/pvic/5.png",
        "/img/pvic/6.png",
        "/img/pvic/7.png",
        "/img/pvic/8.png"
      ]
    },
    "edusyst": {
      "name": "EduSyst",
      "type": "Academic project",
      "year": "2024",
      "text": "EduSyst is a student information system (SIS) designed to modernize and streamline school administration in the public schools of Rio de Janeiro, Brazil. Developed as my final academic project at ISERJ, it was the culmination of my studies in Information Technology and earned me my associate degree. <br/> The system connects students, parents, teachers, and administrators through a unified digital platform, enhancing communication and organization. EduSyst consists of three interconnected applications, each tailored to different user needs and powered by a centralized MySQL database. <br/><br/> - The <strong> EduSyst Desktop App</strong>, built with Java SE, Swing, and the JDBC API, is designed for school administrators. It handles student and teacher registrations, course management, scheduling, and report generation, ensuring smooth institutional operations. <br/> - The <strong>EduSyst Web App</strong>, developed using Java Server Pages (JSP), HTML, CSS, Bootstrap, and JavaScript, serves students, teachers, and parents. Teachers can manage grades, transcripts, and student assessments while also communicating with students through a class chat system. Parents and students can access class schedules, assignments, and teacher information. <br/> - The <strong>EduSyst Mobile App</strong>, built with Android Studio (Java) and PHP for MySQL connectivity, offers a native mobile experience. It provides students, teachers, and parents with the same essential functionalities as the web app, ensuring accessibility on the go. <br/><br/> EduSyst was a challenge that pushed me to apply everything I had learned, from databases to fullstack development. Seeing it come together reinforced my passion for building software that solves real problems.",
      "stack": "html,css,bootstrap,js,java,mysql,androidstudio,php",
      "links": {
        "git": "https://github.com/gabcasanova/EduSyst",
        "docs": "https://drive.google.com/file/d/12UIDfrynj5Vg_2uMZ0yGxDLYsnEQFWQT"
      },
      "pics": [
        "/img/edusyst/1.png",
        "/img/edusyst/2.png",
        "/img/edusyst/3.png",
        "/img/edusyst/4.png",
        "/img/edusyst/5.png",
        "/img/edusyst/6.png",
        "/img/edusyst/7.png",
        "/img/edusyst/8.png"
      ]
    },
    "ednaldo": {
      "name": "Ednaldo Pereira: MESCLADASSO",
      "type": "Voluntary Collaboration on Community Indie Game",
      "year": "2020",
      "text": "Ednaldo Pereira: MESCLADASSO is a free independent game released in 2020, based on the singer and Brazilian internet personality, Ednaldo Pereira. It is a 2D platformer collectathon inspired by classics such as Super Mario 64 and Spongebob SquarePants: Battle for Bikini Bottom. The game features an original story where Ednaldo and his friend Fleig defend the universe from a robot invasion created by the dreaded Elite Preta.<br/><br/>The game attracted widespread coverage in Brazilian outlets such as G1, Jovem Nerd, and entertainment channels like Flow Podcast, Coisa Nossa (Guaraná Antártica), Andrézitos, and Cellbit.<br/><br/>I was responsible for developing the game's launcher and update system (updater). In addition to the technical side, I worked on team organization and the creation of graphic and audiovisual assets for the project's marketing campaign.",
      "stack": "gamemakerstudio",
      "links": {
        "play": "https://gamejolt.com/games/ednaldopereira/513510",
        "vid": "https://youtu.be/n1Y4XidiC0g"
      },
      "pics": [
        "/img/ednaldo/1.png",
        "/img/ednaldo/2.png",
        "/img/ednaldo/3.png",
        "/img/ednaldo/4.png",
        "/img/ednaldo/5.png",
        "/img/ednaldo/6.png",
        "/img/ednaldo/7.png",
        "/img/ednaldo/8.png"
      ]
    },
    "artius": {
      "name": "ARTIUS: Pure Imagination",
      "type": "Game Producer and Additional Game Developer",
      "year": "2026",
      "text": "ARTIUS: Pure Imagination is a fast-paced, momentum-based 2D platformer where you play as distinct artists with unique abilities, battling to preserve creativity in a world on the verge of artistic extinction! Dash, swing, and smash your way through a vibrant, hand-drawn world in this adrenaline-fueled platformer where style is your strongest weapon.<br/><br/>I joined the ARTIUS team by contributing to the Game Design Document (GDD) and the game pitch, which eventually led to a partnership with the Chinese publisher IndieArk. Following this, I took on the roles of Game Producer and Additional Game Developer.<br/><br/>As a producer, my main responsibility was to organize and coordinate the development process. I assisted in planning the roadmap, managing team priorities, and ensuring clear communication across all departments. Beyond internal management, I handled external relations and communication with the publisher. Additionally, I represented the project at major events and conferences, such as Gamescom LATAM and Festival Jogatório.<br/><br/>As a game developer, I was responsible for bug fixing, optimization, and internal tooling. My work also included localization support for multiple languages, scripting cutscenes and in-game events, implementing 3D systems, and porting the game to different platforms, including Web and Linux.",
      "stack": "gamemakerstudio,js",
      "links": {
        "play": "https://store.steampowered.com/app/3599920/ARTIUS_Pure_Imagination/",
        "site": "https://pvicvg.com/#/artius",
        "vid": "https://youtu.be/NbMfHNUAw_k"
      },
      "pics": [
        "/img/artius/1.gif",
        "/img/artius/2.jpg",
        "/img/artius/3.jpg",
        "/img/artius/4.jpg",
        "/img/artius/5.jpg",
        "/img/artius/6.jpg",
        "/img/artius/7.jpg",
        "/img/artius/8.jpg"
      ]
    }
  },

  "experiences": {
    "academic": [
      {
        "institution": "ISERJ - Higher Education Institute of Rio de Janeiro",
        "img": "/img/logos/iserj.png",
        "date": "Mar/2022 - Nov/2024 • 3 years",
        "location": "Rio de Janeiro, Brazil",
        "role": "Associate Degree in Information Technology",
        "text": "During my three years at the institute, I acquired solid skills in programming, systems development, and data modeling (UML). I gained experience in developing web applications with front-end (HTML, CSS, JavaScript, Bootstrap) and back-end (Java EE [JSP, Servlets], PHP, MySQL) technologies, in addition to developing desktop applications using Java SE and Swing. I complemented this training with the development of mobile applications for the Android platform using Java and Android Studio, and gained proficiency in installing and maintaining Linux operating systems (Ubuntu, Debian)."
      }
    ],
    "companies": [
      {
        "institution": "PVic Games",
        "img": "/img/logos/pvic.png",
        "date": "Jul/2025 - Present",
        "location": "Remote",
        "role": "Game Producer",
        "text": "As a producer, my main responsibility is to organize and coordinate the game development process. I assist in planning our roadmap, managing team priorities, and ensuring clear communication across all departments. Beyond internal management, I am also involved in our external relationships and communication with the publisher. This includes preparing project updates, aligning expectations, and ensuring that milestones are met by both parties. Additionally, I represent the studio at events and conferences (Gamescom LATAM, Festival Jogatório)."
      },
      {
        "institution": "PVic Games",
        "img": "/img/logos/pvic.png",
        "date": "Apr/2025 - Present",
        "location": "Remote",
        "role": "Game Developer (GML / GameMaker)",
        "text": "I am a game developer at the indie studio PVic Games, working on the development of the 2D platformer 'ARTIUS: Pure Imagination' using the GameMaker Engine. Responsible for bug fixing, optimization, internal tooling, localization support for different languages, scripting of cutscenes and in-game events, 3D systems, and porting to different platforms (Web, Linux)."
      },
      {
        "institution": "PVic Games",
        "img": "/img/logos/pvic.png",
        "date": "Dec/2024 - Apr/2025 • 5 months",
        "location": "Remote",
        "role": "Freelance Web Developer (React/TypeScript)",
        "text": "Acted as a freelance developer in the creation of the official website for the indie game studio PVic Games (http://pvicvg.com/). The design, inspired by the works of Brazilian artist Ziraldo, was created by me in collaboration with the client to reflect their vision. The site is a responsive single-page application (SPA) built with Vite, React, TypeScript, and Tailwind CSS."
      },
      {
        "institution": "IME/UERJ - Institute of Mathematics and Statistics",
        "img": "/img/logos/ime.png",
        "date": "Mar/2024 - Nov/2024 • 9 months",
        "location": "Rio de Janeiro, Brazil • On-site",
        "role": "Web Development Intern (WordPress/PHP)",
        "text": "Responsible for backend development and maintenance of the institute's web portal, which utilizes WordPress. I was the lead developer for internal areas dedicated to professors and the administrative office. My contributions included developing custom PHP scripts and plugins to enhance WordPress backend functionality and the efficient integration of the institute's secondary institutional databases into the main MySQL database."
      },
      {
        "institution": "FAPERJ",
        "img": "/img/logos/faperj.png",
        "date": "Jan/2023 - Dec/2024 • 2 years",
        "location": "Rio de Janeiro, Brazil • Hybrid",
        "role": "Research Internship",
        "text": "Intern Researcher and scholar at GPEEsC (Research Group on School, Sports, and Culture), providing IT support, including equipment configuration, technical support, and document transcription using Office Suite tools."
      }
    ]
  },

  "footer": {
    "text": "All rights reserved. Rio de Janeiro, Brazil.",
    "lang": "Language: ",
    "en": "English",
    "pt": "Portuguese"
  }
}