{
  "navbar": {
    "title": "Gabriel Casanova",

    "links": [
      { "text": "home", "url": "/" },
      { "text": "experiência", "url": "/exp" },
      { "text": "sobre", "url": "/about" }
    ]
  },

  "pages": {
    "home": {
      "title": "Portfólio de Desenvolvimento Web"
    },

    "project": {
      "title": "Projeto",
      "return": "Voltar",
      "stack": "Tecnologias",
      "links": "Links",
      "git": "GitHub",
      "site": "Site",
      "docs": "Documentação",
      "vid": "Vídeo Demo"
    },

    "experience": {
      "title": "Experiência",
      "education": "Educação",
      "career": "Carreira"
    },

    "about": {
      "title": "Sobre",
      "titleBig": "Sobre Mim",
      "text": "Olá! Sou apaixonado por criar coisas que tornam o dia a dia mais fácil — seja desenvolvendo experiências web intuitivas ou encontrando formas mais eficientes de organizar informações. Gosto de unir criatividade com praticidade e estou sempre em busca de soluções simples, funcionais e úteis — tanto para quem usa quanto para quem desenvolve."
    },

    "notfound": {
      "text": "Página não encontrada.",
      "return": "Voltar para a página inicial?"
    }
  },

  "projects": {
    "portfolio": {
      "name": "gabrielcasanova.com.br",
      "type": "Projeto pessoal",
      "year": "2025",
      "text": "Meu site pessoal. O site é uma single-page application (SPA), desenvolvido com Vite, React, TypeScript e Tailwind. Ele oferece navegação fluida utilizando React Router e suporte aos idiomas português e inglês por meio da integração com a biblioteca i18n.",
      "stack": "vite,ts,react,tailwind",
      "links": {
        "site": "https://gabrielcasanova.com.br/",
        "git": "https://github.com/gabcasanova/gabcasanova.github.io"
      },
      "pics": [
        "/img/portfolio/1.png",
        "/img/portfolio/2.png",
        "/img/portfolio/3.png",
        "/img/portfolio/4.png",
        "/img/portfolio/5.png",
        "/img/portfolio/6.png"
      ]
    },
    "pvic": {
      "name": "PVic Games Website",
      "type": "Projeto freelancer",
      "year": "2025",
      "text": "Atuei como desenvolvedor freelancer na criação do site oficial do estúdio de jogos indie PVic Games. O design, inspirado nas obras do artista brasileiro Ziraldo, foi criado por mim com a orientação do cliente para atender à sua visão. O site é uma single-page application (SPA), desenvolvido com Vite, React, TypeScript e Tailwind. Ele oferece navegação fluida utilizando React Router e suporte aos idiomas português e inglês por meio da integração com a biblioteca i18n. Animações modernas, implementadas com Animate.css e AOS, aprimoram a experiência do usuário. A página 'sobre' inclui um modelo 3D interativo implementado com a biblioteca WebGL Three.js, adicionando um elemento dinâmico e divertido ao site, aumentando o engajamento do usuário.",
      "stack": "vite,ts,react,tailwind",
      "links": {
        "site": "https://pvicvg.com/",
        "git": "https://github.com/pvicgames/pvicgames.github.io"
      },
      "pics": [
        "/img/pvic/1.png",
        "/img/pvic/2.png",
        "/img/pvic/3.png",
        "/img/pvic/4.png",
        "/img/pvic/5.png",
        "/img/pvic/6.png",
        "/img/pvic/7.png",
        "/img/pvic/8.png"
      ]
    },
    "edusyst": {
      "name": "EduSyst",
      "type": "Projeto acadêmico",
      "year": "2024",
      "text": "EduSyst é um sistema de informações estudantis (SIS) projetado para modernizar e otimizar a administração escolar de escolas públicas na cidade do Rio de Janeiro, Brasil. Desenvolvido como meu trabalho de conclusão de curso no ISERJ/FAETEC, foi a culminação dos meus estudos e me garantiu o diploma de técnico em informática. <br/> O sistema conecta alunos, pais, professores e administradores por meio de uma plataforma digital unificada, aprimorando a comunicação e a organização. O EduSyst é composto por três aplicativos interconectados, cada um adaptado às necessidades dos diferentes usuários e alimentado por um banco de dados MySQL centralizado. <br/><br/> - O <strong>Aplicativo Desktop EduSyst</strong>, desenvolvido com Java SE, Swing e a API JDBC, foi projetado para administradores escolares. Ele gerencia cadastros de alunos e professores, organização de cursos, cronogramas e geração de relatórios, garantindo operações institucionais eficientes. <br/> - O <strong>Aplicativo Web EduSyst</strong>, desenvolvido com Java Server Pages (JSP), HTML, CSS, Bootstrap e JavaScript, atende a alunos, professores e pais. Os professores podem gerenciar notas, históricos escolares e avaliações dos alunos, além de se comunicarem com os estudantes por meio de um sistema de chat de classe. Pais e alunos têm acesso a horários de aula, tarefas e informações dos professores. <br/> - O <strong>Aplicativo Mobile EduSyst</strong>, construído com Android Studio (Java) e PHP para conectividade MySQL, oferece uma experiência nativa no Android. Ele fornece aos alunos, professores e pais as mesmas funcionalidades essenciais do aplicativo web, garantindo acessibilidade em qualquer lugar. <br/><br/> O EduSyst foi um desafio que me levou a aplicar tudo o que aprendi, desde bancos de dados até desenvolvimento fullstack. Ver o projeto se concretizar reforçou minha paixão por criar softwares que resolvem problemas reais.",
      "stack": "html,css,bootstrap,js,java,mysql,androidstudio,php",
      "links": {
        "git": "https://github.com/gabcasanova/EduSyst",
        "docs": "https://drive.google.com/file/d/12UIDfrynj5Vg_2uMZ0yGxDLYsnEQFWQT"
      },
      "pics": [
        "/img/edusyst/1.png",
        "/img/edusyst/2.png",
        "/img/edusyst/3.png",
        "/img/edusyst/4.png",
        "/img/edusyst/5.png",
        "/img/edusyst/6.png",
        "/img/edusyst/7.png",
        "/img/edusyst/8.png"
      ]
    }
  },

  "experiences": {
    "academic": [
      {
        "institution": "UERJ - Universidade do Estado do Rio de Janeiro",
        "img": "/img/logos/uerj.png",
        "date": "ago/2025 - até agora",
        "location": "Rio de Janeiro, Brasil",
        "role": "Bacharelado em Ciência da Computação",
        "text": "Cursando."
      },
      {
        "institution": "ISERJ - Instituto Superior de Educação do Rio de Janeiro",
        "img": "/img/logos/iserj.png",
        "date": "mar/2022 - nov/2024 • 3 anos",
        "location": "Rio de Janeiro, Brasil",
        "role": "Ensino Médio Técnico em Informática",
        "text": "Durante meus três anos de formação técnica no ISERJ, desenvolvi habilidades sólidas em programação, desenvolvimento de sistemas e modelagem de dados. Trabalhei com desenvolvimento web front-end (HTML, CSS, JavaScript, Bootstrap) e back-end (Java EE, JSP, PHP), integrando bancos de dados MySQL. Também adquiri experiência em modelagem de sistemas com UML, desenvolvimento de aplicações desktop com Java SE e desenvolvimento mobile para Android com Java e Android Studio."
      }
    ],
    "companies": [
      {
        "institution": "PVic Games",
        "img": "/img/logos/pvic.png",
        "date": "dez/2024 - até agora",
        "location": "Remoto",
        "role": "Desenvolvedor Web Freelancer (React/TypeScript)",
        "text": "Atuei como desenvolvedor freelancer na criação do site oficial do estúdio de jogos indie PVic Games (http://pvicvg.com/). O design, inspirado nas obras do artista brasileiro Ziraldo, foi criado por mim em colaboração com o cliente para refletir sua visão. O site é uma single-page application (SPA), responsiva, construída com Vite, React, TypeScript e Tailwind CSS."
      },
      {
        "institution": "IME/UERJ - Instituto de Matemática e Estatística",
        "img": "/img/logos/ime.png",
        "date": "mar/2024 - set/2024 • 7 meses",
        "location": "Rio de Janeiro, Brasil • Presencial",
        "role": "Estagiário de Desenvolvimento Web (WordPress/PHP)",
        "text": "Programação web backend e manutenção do site do instituto. Desenvolvimento de áreas internas do site para os professores e a secretaria do instituto, auxiliando na integração de outros bancos de dados institucionais ao banco de dados principal em MySQL. Também desenvolvi plugins e scripts personalizados em PHP para a back-end do WordPress."
      },
      {
        "institution": "FAPERJ",
        "img": "/img/logos/faperj.png",
        "date": "jan/2023 - dez/2024 • 2 anos",
        "location": "Rio de Janeiro, Brasil • Híbrido",
        "role": "Bolsista de Pré-Iniciação Científica",
        "text": "Bolsista no GPEEsC (Grupo de Pesquisa em Escola, Esporte e Cultura), prestando suporte de TI, incluindo configuração de equipamentos, suporte técnico e transcrição de documentos utilizando ferramentas do pacote Office."
      }
    ]
  },

  "footer": {
    "text": "Todos os direitos reservados. Rio de Janeiro, Brasil.",
    "lang": "Idioma: ",
    "en": "Inglês",
    "pt": "Português"
  }
} 