{
  "navbar": {
    "title": "Gabriel Casanova",

    "links": [
      { "text": "home", "url": "/" },
      { "text": "experiência", "url": "/exp" },
      { "text": "sobre", "url": "/about" }
    ]
  },

  "pages": {
    "home": {
      "web": "Portfólio de Desenvolvimento Web",
      "games": "Portfólio de Desenvolvimento de Jogos"
    },

    "project": {
      "title": "Projeto",
      "return": "Voltar",
      "stack": "Tecnologias",
      "links": "Links",
      "git": "GitHub",
      "site": "Site",
      "docs": "Documentação",
      "vid": "Vídeo",
      "play": "Jogar"
    },

    "experience": {
      "title": "Experiência",
      "education": "Educação",
      "career": "Carreira"
    },

    "about": {
      "title": "Sobre",
      "titleBig": "Sobre Mim",
      "text": "👋 Olá! Me chamo Gabriel Casanova. <br/><br/> Sou um profissional multidisciplinar com atuação nas áreas de game design, produção e desenvolvimento de jogos e desenvolvimento web. <br/><br/> Gosto de trabalhar na interseção entre criatividade e tecnologia. Estou sempre em busca de aprender, colaborar e contribuir para projetos significativos!"
    },

    "notfound": {
      "text": "Página não encontrada.",
      "return": "Voltar para a página inicial?"
    }
  },

  "projects": {
    "sonicmegamix": {
      "name": "Sonic Megamix Mania Website",
      "type": "Projeto freelancer",
      "year": "2026",
      "text": "Site do projeto Sonic Megamix Mania. O site é uma single-page application (SPA), desenvolvida com Vite, React, TypeScript e Tailwind. O projeto explora a interatividade web para recriar a atmosfera dos jogos clássicos 16-bit através de efeitos de parallax e animações customizadas. O diferencial técnico reside na animação da página principal, que utiliza sete camadas de imagem sincronizadas para simular um efeito de mar dinâmico, simulando os visuais dos jogos clássicos do Sonic.",
      "stack": "vite,ts,react,tailwind",
      "links": {
        "site": "https://sonicmegamixmania.github.io/",
        "git":  "https://github.com/SonicMegamixMania/sonicmegamixmania.github.io"
      },
      "pics": [
        "/img/sonicmegamix/1.png",
        "/img/sonicmegamix/2.png",
        "/img/sonicmegamix/3.png",
        "/img/sonicmegamix/4.png",
        "/img/sonicmegamix/5.png",
        "/img/sonicmegamix/6.png",
        "/img/sonicmegamix/7.png"
      ]
    },
    "lucia": {
      "name": "Portfolio de Lucia Ippolito",
      "type": "Projeto freelancer",
      "year": "2025",
      "text": "Portfolio da jornalista brasileira Lucia Ippolito. O site é uma single-page application (SPA), desenvolvida com Vite, React, TypeScript e Tailwind. É alimentado por conteúdo estruturado em JSON, permitindo que a cliente atualize e expanda seções facilmente sem modificar o código. Ele oferece navegação fluida utilizando React Router e suporte à localização por meio da integração com a biblioteca i18n.",
      "stack": "vite,ts,react,tailwind",
      "links": {
        "site": "https://luciaippolito.github.io/",
        "git":  "https://github.com/luciaippolito/luciaippolito.github.io"
      },
      "pics": [
        "/img/lucia/1.png",
        "/img/lucia/2.png",
        "/img/lucia/3.png",
        "/img/lucia/4.png",
        "/img/lucia/5.png",
        "/img/lucia/6.png",
        "/img/lucia/7.png"
      ]
    },
    "portfolio": {
      "name": "gabrielcasanova.com.br",
      "type": "Projeto pessoal",
      "year": "2025",
      "text": "Meu site pessoal. O site é uma single-page application (SPA), desenvolvida com Vite, React, TypeScript e Tailwind. Ele oferece navegação fluida utilizando React Router e suporte aos idiomas português e inglês por meio da integração com a biblioteca i18n.",
      "stack": "vite,ts,react,tailwind",
      "links": {
        "site": "https://gabrielcasanova.com.br/",
        "git": "https://github.com/gabcasanova/gabcasanova.github.io"
      },
      "pics": [
        "/img/portfolio/1.png",
        "/img/portfolio/2.png",
        "/img/portfolio/3.png",
        "/img/portfolio/4.png",
        "/img/portfolio/5.png",
        "/img/portfolio/6.png"
      ]
    },
    "pvic": {
      "name": "PVic Games Website",
      "type": "Projeto freelancer",
      "year": "2025",
      "text": "Atuei como desenvolvedor freelancer na criação do site oficial do estúdio de jogos indie PVic Games. O design, inspirado nas obras do artista brasileiro Ziraldo, foi criado por mim com a orientação do cliente para atender à sua visão. O site é uma single-page application (SPA), desenvolvida com Vite, React, TypeScript e Tailwind. Ele oferece navegação fluida utilizando React Router e suporte aos idiomas português e inglês por meio da integração com a biblioteca i18n. Animações modernas, implementadas com Animate.css e AOS, aprimoram a experiência do usuário. A página 'sobre' inclui um modelo 3D interativo implementado com a biblioteca WebGL Three.js, adicionando um elemento dinâmico e divertido ao site, aumentando o engajamento do usuário.",
      "stack": "vite,ts,react,tailwind",
      "links": {
        "site": "https://pvicvg.com/",
        "git": "https://github.com/pvicgames/pvicgames.github.io"
      },
      "pics": [
        "/img/pvic/1.png",
        "/img/pvic/2.png",
        "/img/pvic/3.png",
        "/img/pvic/4.png",
        "/img/pvic/5.png",
        "/img/pvic/6.png",
        "/img/pvic/7.png",
        "/img/pvic/8.png"
      ]
    },
    "edusyst": {
      "name": "EduSyst",
      "type": "Projeto acadêmico",
      "year": "2024",
      "text": "EduSyst é um sistema de informações estudantis (SIS) projetado para modernizar e otimizar a administração escolar de escolas públicas na cidade do Rio de Janeiro, Brasil. Desenvolvido como meu trabalho de conclusão de curso no ISERJ/FAETEC, foi a culminação dos meus estudos e me garantiu o diploma de técnico em informática. <br/> O sistema conecta alunos, pais, professores e administradores por meio de uma plataforma digital unificada, aprimorando a comunicação e a organização. O EduSyst é composto por três aplicativos interconectados, cada um adaptado às necessidades dos diferentes usuários e alimentado por um banco de dados MySQL centralizado. <br/><br/> - O <strong>Aplicativo Desktop EduSyst</strong>, desenvolvido com Java SE, Swing e a API JDBC, foi projetado para administradores escolares. Ele gerencia cadastros de alunos e professores, organização de cursos, cronogramas e geração de relatórios, garantindo operações institucionais eficientes. <br/> - O <strong>Aplicativo Web EduSyst</strong>, desenvolvido com Java Server Pages (JSP), HTML, CSS, Bootstrap e JavaScript, atende a alunos, professores e pais. Os professores podem gerenciar notas, históricos escolares e avaliações dos alunos, além de se comunicarem com os estudantes por meio de um sistema de chat de classe. Pais e alunos têm acesso a horários de aula, tarefas e informações dos professores. <br/> - O <strong>Aplicativo Mobile EduSyst</strong>, construído com Android Studio (Java) e PHP para conectividade MySQL, oferece uma experiência nativa no Android. Ele fornece aos alunos, professores e pais as mesmas funcionalidades essenciais do aplicativo web, garantindo acessibilidade em qualquer lugar. <br/><br/> O EduSyst foi um desafio que me levou a aplicar tudo o que aprendi, desde bancos de dados até desenvolvimento fullstack. Ver o projeto se concretizar reforçou minha paixão por criar softwares que resolvem problemas reais.",
      "stack": "html,css,bootstrap,js,java,mysql,androidstudio,php",
      "links": {
        "git": "https://github.com/gabcasanova/EduSyst",
        "docs": "https://drive.google.com/file/d/12UIDfrynj5Vg_2uMZ0yGxDLYsnEQFWQT"
      },
      "pics": [
        "/img/edusyst/1.png",
        "/img/edusyst/2.png",
        "/img/edusyst/3.png",
        "/img/edusyst/4.png",
        "/img/edusyst/5.png",
        "/img/edusyst/6.png",
        "/img/edusyst/7.png",
        "/img/edusyst/8.png"
      ]
    },
    "ednaldo": {
      "name": "Ednaldo Pereira: MESCLADASSO",
      "type": "Colaboração Voluntária em Indie Game Comunitário",
      "year": "2020",
      "text": "Ednaldo Pereira: MESCLADASSO é um jogo independente gratuito lançado em 2020, baseado no cantor e personalidade de internet, Ednaldo Pereira. É um platformer 2D collectathon, inspirado em clássicos como Super Mario 64 e Spongebob Battle for Bikini Bottom. O jogo apresenta uma história original em que Ednaldo e seu amigo Fleig defendem o universo de uma invasão de robôs criada pela temida Elite Preta.<br/><br/>O jogo atraiu ampla repercussão em veículos como G1, Jovem Nerd e canais de entretenimento como Flow Podcast, Coisa Nossa (Guaraná Antártica), Andrézitos e Cellbit.<br/><br/>Fui responsável pelo desenvolvimento do launcher e sistema de atualização (updater) do jogo. Além da frente técnica, atuei na organização da equipe e na criação de peças gráficas e audiovisuais para a campanha de marketing do projeto.",
      "stack": "gamemakerstudio",
      "links": {
        "play": "https://gamejolt.com/games/ednaldopereira/513510",
        "vid": "https://youtu.be/n1Y4XidiC0g"
      },
      "pics": [
        "/img/ednaldo/1.png",
        "/img/ednaldo/2.png",
        "/img/ednaldo/3.png",
        "/img/ednaldo/4.png",
        "/img/ednaldo/5.png",
        "/img/ednaldo/6.png",
        "/img/ednaldo/7.png"
      ]
    }
  },

  "experiences": {
    "academic": [
      {
        "institution": "ISERJ - Instituto Superior de Educação do Rio de Janeiro",
        "img": "/img/logos/iserj.png",
        "date": "mar/2022 - nov/2024 • 3 anos",
        "location": "Rio de Janeiro, Brasil",
        "role": "Ensino Médio Técnico em Informática",
        "text": "Durante os três anos do Curso Técnico em Informática, adquiri habilidades sólidas em programação, desenvolvimento de sistemas e modelagem de dados (UML). Obtive experiência no desenvolvimento de aplicações web com tecnologias front-end (HTML, CSS, JavaScript, Bootstrap) e back-end (Java EE [JSP, Servlets], PHP, MySQL), além de desenvolver aplicações desktop utilizando Java SE e Swing. Complementei essa formação com o desenvolvimento de aplicativos mobile para a plataforma Android com Java e Android Studio, e ganhei proficiência na instalação e manutenção de sistemas operacionais Linux (Ubuntu, Debian)."
      }
    ],
    "companies": [
      {
        "institution": "PVic Games",
        "img": "/img/logos/pvic.png",
        "date": "jul/2025 - atualmente",
        "location": "Remoto",
        "role": "Produtor de Jogos",
        "text": "Como produtor, minha responsabilidade principal é organizar e coordenar o processo de desenvolvimento dos jogos. Auxilio no planejamento do nosso roadmap, na gestão de prioridades da equipe e na garantia de uma boa comunicação entre todas as áreas. Além da gestão interna, também estou envolvido em nossos relacionamentos externos e na comunicação com a publisher. Isso inclui preparar atualizações do projeto, alinhar expectativas e garantir que as metas sejam cumpridos por ambas as partes. Além disso, represento o estúdio em eventos e conferências (Gamescom LATAM, Festival Jogatório)."
      },
      {
        "institution": "PVic Games",
        "img": "/img/logos/pvic.png",
        "date": "abr/2025 - atualmente",
        "location": "Remoto",
        "role": "Desenvolvedor de Jogos (GML / GameMaker)",
        "text": "Sou desenvolvedor de jogos no estúdio indie PVic Games, atuando no desenvolvimento do platformer 2D ''ARTIUS: Pure Imagination'', trabalhando com a GameMaker Engine. Responsável por bugfixing, otimização, tooling interno, suporte de localização para diferentes idiomas, scripting de cutscenes e eventos in-game, sistemas 3D e porting para diferentes plataformas (Web, Linux)."
      },
      {
        "institution": "PVic Games",
        "img": "/img/logos/pvic.png",
        "date": "dez/2024 - abr/2025 • 5 meses",
        "location": "Remoto",
        "role": "Desenvolvedor Web Freelancer (React/TypeScript)",
        "text": "Atuei como desenvolvedor freelancer na criação do site oficial do estúdio de jogos indie PVic Games (http://pvicvg.com/). O design, inspirado nas obras do artista brasileiro Ziraldo, foi criado por mim em colaboração com o cliente para refletir sua visão. O site é uma single-page application (SPA), responsiva, construída com Vite, React, TypeScript e Tailwind CSS."
      },
      {
        "institution": "IME/UERJ - Instituto de Matemática e Estatística",
        "img": "/img/logos/ime.png",
        "date": "mar/2024 - nov/2024 • 9 meses",
        "location": "Rio de Janeiro, Brasil • Presencial",
        "role": "Estagiário de Desenvolvimento Web (WordPress/PHP)",
        "text": "Responsável pelo desenvolvimento backend e manutenção do portal web do instituto, que utiliza WordPress. Fui o desenvolvedor principal de áreas internas destinadas a professores e à secretaria. Minhas contribuições incluíram o desenvolvimento de plugins e scripts PHP personalizados para aprimorar a funcionalidade do backend do WordPress e a integração eficiente de bancos de dados institucionais secundários do instituto ao banco de dados principal em MySQL."
      },
      {
        "institution": "FAPERJ",
        "img": "/img/logos/faperj.png",
        "date": "jan/2023 - dez/2024 • 2 anos",
        "location": "Rio de Janeiro, Brasil • Híbrido",
        "role": "Bolsista de Pré-Iniciação Científica",
        "text": "Aluno pesquisador bolsista no GPEEsC (Grupo de Pesquisa em Escola, Esporte e Cultura), prestando suporte de TI, incluindo configuração de equipamentos, suporte técnico e transcrição de documentos utilizando ferramentas do pacote Office."
      }
    ]
  },

  "footer": {
    "text": "Todos os direitos reservados. Rio de Janeiro, Brasil.",
    "lang": "Idioma: ",
    "en": "Inglês",
    "pt": "Português"
  }
} 